# -*- coding: utf-8 -*-
"""
Задание 5.2b

Преобразовать скрипт из задания 5.2a таким образом,
чтобы сеть/маска не запрашивались у пользователя,
а передавались как аргумент скрипту.

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""
from sys import argv

subnet = argv[1]
network = subnet[:subnet.find("/"):]
ml = subnet[:subnet.find("/"):-1]
ml = int(ml[::-1])
m="1"*ml
m=m+"0"*(32-ml)
net = network.split(".")
n=f"{bin(int(net[0]))[2:]:>08}"
n=n+f"{bin(int(net[1]))[2:]:>08}"
n=n+f"{bin(int(net[2]))[2:]:>08}"
n=n+f"{bin(int(net[3]))[2:]:>08}"
n=n[:ml]
n=n+"0"*(32-ml)

print (f"""

network: 
{int(n[0:8], 2):<10} {int(n[8:16], 2):<10} {int(n[16:24], 2):<10} {int(n[24:32], 2):<10}
{n[0:8]:<10} {n[8:16]:<10} {n[16:24]:<10} {n[24:32]:<10}
Mask:
/{ml}
{int(m[0:8], 2):<10} {int(m[8:16], 2):<10} {int(m[16:24], 2):<10} {int(m[24:], 2):<10}
{int(m[0:8]):<10} {int(m[8:15]):<10} {int(m[16:23]):<10} {int(m[24:32]):<10}
""")


