# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
subnet = input("enter subnet:  ")
network = subnet[:subnet.find("/"):]
n=network.split(".")
mask = subnet[:subnet.find("/"):-1]
mask = int(mask[::-1])
m="1"*mask
m=m+"0"*(32-mask)
n = network.split(".")
print (f"""
network:
{str(n[0]):<10} {str(n[1]):<10} {str(n[2]):<10} {str(n[3]):<10}
{int(n[0]):<08b}  {int(n[1]):<08b}  {int(n[2]):<08b}  {int(n[3]):<08b}
Mask:
/{mask}
{int(m[0:8], 2):<10} {int(m[8:16], 2):<10} {int(m[16:24], 2):<10} {int(m[24:], 2):<10}
{int(m[0:8]):<10} {int(m[8:15]):<10} {int(m[16:23]):<10} {int(m[24:32]):<10}
""")
